In [1]:
import requests

In [10]:
import pandas as pd

In [11]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [12]:
resp = requests.get(url, verify=False)

C:\Users\11321\AppData\Local\Programs\Python\Python314\Lib\site-packages\urllib3\connectionpool.py:1097: InsecureRequestWarning: Unverified HTTPS request is being made to host 'api.github.com'. Adding certificate verification is strongly advised. See: https://urllib3.readthedocs.io/en/latest/advanced-usage.html#tls-warnings
  warnings.warn(

In [13]:
resp.raise_for_status()

In [14]:
resp

In [15]:
data = resp.json()

In [16]:
data[0]["title"]

'Update license year to 2026'

In [17]:
issues = pd.DataFrame(data, columns=["number", "title",
                                     "labels", "state"])

In [18]:
issues

,number,title,labels,state
0,63538,Update license year to 2026,[],open
1,63537,DOC: Inline docstring in `pandas/io/json/_json...,[],open
2,63536,DOC: Inline docstring in `pandas/io/formats/ex...,[],open
3,63535,DOC: Inline docstring in `pandas/io/common.py`,[],open
4,63534,DOC: Inline docstring in `pandas/io/formats/xm...,[],open
5,63533,API: Timedelta/to_timedelta with round-floats ...,[],open
6,63532,BUG: Avoid precision loss for large integral D...,[],open
7,63531,BUG: Fix unstack(sort=False) reordering rows (...,[],open
8,63530,ENH: Add opt-in diagnostics report,[],open
9,63529,feat: Add fix to pyarrow,[],open
10,63528,DOC: Inline docstrings for argmax and argmin i...,[],open
11,63527,BUG: PyArrow-backed datetime index missing num...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
12,63526,BUG: `.loc` slicing fails on PyArrow-backed da...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
13,63524,DOC: clarify note about optimized indexing met...,[],open
14,63516,DOC: Inline docstring for str.rpartition,[],open
15,63515,DOC: Inline docstring for str.partition,[],open
16,63514,"BUG: Fix get_level_values for boolean, NA-like...",[],open
17,63513,ENH: Add strict=True to zip() calls in pandas/...,[],open
18,63512,API: Add reduction methods to pandas EAs,[],open
19,63511,ENH: first-class UUID support,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
20,63510,DOC: simplify Series.sum examples to show scal...,[],open
21,63505,DOC : document pyarrow vs python string trade-...,[],open
22,63503,BUG: Fix for Issue 53028 - Fix DictCursor retu...,[],open
23,63500,CoW: better chained assignment warning message...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
24,63499,BUG/API: Series constructor to honor unit of s...,"[{'id': 49597148, 'node_id': 'MDU6TGFiZWw0OTU5...",open
25,63497,DOC: Clarify multiset behaviour of Index.union...,[],open
26,63492,CLN: Create temporary HDF5 file path and HDFSt...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
27,63485,BUG: Fix str.cat losing StringDtype on index d...,[],open
28,63484,BUG: pd.api.types.pandas_dtype raise different...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,63482,TST: Add tests for pyarrow dtype_backend behav...,[],open

In [19]:
import sqlite3

In [20]:
query = """
        CREATE TABLE test
        (a VARCHAR(20), b VARCHAR(20),
        c REAL, d INTEGER
        );"""

In [21]:
con = sqlite3.connect("mydata.sqlite")

In [22]:
con.execute(query)

In [23]:
con.commit()

In [25]:
data = [("Atlanta", "Georgia", 1.25, 6),
        ("Tallahassee", "Florida", 2.6, 3),
        ("Sacramento", "California", 1.7, 5)]

In [26]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [27]:
con.executemany(stmt, data)

In [28]:
con.commit()

In [31]:
curson = con.execute("SELECT * FROM test")

In [32]:
rows = curson.fetchall()

In [33]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [34]:
curson.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [36]:
pd.DataFrame(rows, columns=[x[0] for x in curson.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [38]:
import sqlalchemy as sqla

In [39]:
db = sqla.create_engine("sqlite:///mydata.sqlite")

In [40]:
pd.read_sql("SELECT * FROM test", db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [42]:
import numpy as np

In [43]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [44]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [45]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [46]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [48]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [49]:
float_data = pd.Series([1, 2, None], dtype='float64')

In [50]:
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [51]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [52]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [53]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [54]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [57]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                    [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [58]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [61]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [62]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [63]:
data[4] = np.nan

In [64]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [65]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [66]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))

In [67]:
df

          0         1         2
0  3.616659 -1.146077  0.342137
1  0.052599 -0.598214 -0.319719
2  0.086495  0.665335 -1.550036
3  2.428586 -1.583799 -0.816069
4  0.281433  0.462154 -0.185124
5  0.029981  1.007451 -0.766986
6  0.251962  0.509190  0.273053

In [69]:
df.iloc[:4, 1] = np.nan

In [70]:
df.iloc[:2, 2] = np.nan

In [71]:
df

          0         1         2
0  3.616659       NaN       NaN
1  0.052599       NaN       NaN
2  0.086495       NaN -1.550036
3  2.428586       NaN -0.816069
4  0.281433  0.462154 -0.185124
5  0.029981  1.007451 -0.766986
6  0.251962  0.509190  0.273053

In [72]:
df.dropna()

          0         1         2
4  0.281433  0.462154 -0.185124
5  0.029981  1.007451 -0.766986
6  0.251962  0.509190  0.273053

In [73]:
df.dropna(thresh=2)

          0         1         2
2  0.086495       NaN -1.550036
3  2.428586       NaN -0.816069
4  0.281433  0.462154 -0.185124
5  0.029981  1.007451 -0.766986
6  0.251962  0.509190  0.273053

In [74]:
df.fillna(0)

          0         1         2
0  3.616659  0.000000  0.000000
1  0.052599  0.000000  0.000000
2  0.086495  0.000000 -1.550036
3  2.428586  0.000000 -0.816069
4  0.281433  0.462154 -0.185124
5  0.029981  1.007451 -0.766986
6  0.251962  0.509190  0.273053

In [75]:
df.fillna({1: 0.5, 2:0})

          0         1         2
0  3.616659  0.500000  0.000000
1  0.052599  0.500000  0.000000
2  0.086495  0.500000 -1.550036
3  2.428586  0.500000 -0.816069
4  0.281433  0.462154 -0.185124
5  0.029981  1.007451 -0.766986
6  0.251962  0.509190  0.273053

In [76]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [80]:
df.iloc[2:, 1] = np.nan

In [81]:
df.iloc[4:, 2] = np.nan

In [82]:
df

          0         1         2
0 -0.120581 -0.417790  1.255874
1  0.572569  0.050588 -0.466501
2 -1.584828       NaN  0.114471
3  0.365204       NaN -0.712318
4  0.659351       NaN       NaN
5 -2.212221       NaN       NaN

In [85]:
df.ffill()

          0         1         2
0 -0.120581 -0.417790  1.255874
1  0.572569  0.050588 -0.466501
2 -1.584828  0.050588  0.114471
3  0.365204  0.050588 -0.712318
4  0.659351  0.050588 -0.712318
5 -2.212221  0.050588 -0.712318

In [86]:
df.ffill(limit=2)

          0         1         2
0 -0.120581 -0.417790  1.255874
1  0.572569  0.050588 -0.466501
2 -1.584828  0.050588  0.114471
3  0.365204  0.050588 -0.712318
4  0.659351       NaN -0.712318
5 -2.212221       NaN -0.712318

In [87]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [88]:
data.mean()

np.float64(3.8333333333333335)

In [89]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [90]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})

In [91]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [93]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [94]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [95]:
data["v1"] = range(7)

In [96]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [98]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [99]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [100]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [101]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [102]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [103]:
data["animal"] = data["food"].map(meat_to_animal)

In [104]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [106]:
def get_animal(x):
    return meat_to_animal[x]

In [107]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [108]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [109]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [110]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [111]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [112]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [113]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [114]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [115]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [120]:
def transform(x):
    return x[:4].upper()

In [121]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [122]:
data.index = data.index.map(transform)

In [124]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [126]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [127]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [128]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [129]:
bins = [18, 25, 35, 60, 100]

In [130]:
age_categories = pd.cut(ages, bins)

In [131]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [132]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [133]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [134]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [136]:
pd.Series(age_categories).value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [137]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [139]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [140]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [141]:
data = np.random.uniform(size=20)

In [142]:
pd.cut(data, 4, precision=2)

[(0.49, 0.71], (0.044, 0.26], (0.044, 0.26], (0.49, 0.71], (0.71, 0.93], ..., (0.71, 0.93], (0.26, 0.49], (0.044, 0.26], (0.71, 0.93], (0.26, 0.49]]
Length: 20
Categories (4, interval[float64, right]): [(0.044, 0.26] < (0.26, 0.49] < (0.49, 0.71] < (0.71, 0.93]]

In [143]:
data = np.random.standard_normal(1000)

In [144]:
quartiles = pd.qcut(data, 4, precision=2)

In [145]:
quartiles

[(-0.055, 0.66], (-0.055, 0.66], (0.66, 3.07], (-0.055, 0.66], (-2.9299999999999997, -0.73], ..., (0.66, 3.07], (-2.9299999999999997, -0.73], (-0.73, -0.055], (0.66, 3.07], (-0.055, 0.66]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.9299999999999997, -0.73] < (-0.73, -0.055] < (-0.055, 0.66] < (0.66, 3.07]]

In [146]:
pd.Series(quartiles).value_counts()

(-2.9299999999999997, -0.73]    250
(-0.73, -0.055]                 250
(-0.055, 0.66]                  250
(0.66, 3.07]                    250
Name: count, dtype: int64

In [147]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-2.919, -1.377]     100
(-1.377, -0.0551]    400
(-0.0551, 1.309]     400
(1.309, 3.071]       100
Name: count, dtype: int64

In [149]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [150]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.004762     0.029113    -0.006189     0.041353
std       1.005219     1.008941     1.012405     0.974017
min      -3.400652    -3.132459    -3.584241    -2.716920
25%      -0.697211    -0.666513    -0.700967    -0.618165
50%      -0.006616     0.008676    -0.009014     0.011095
75%       0.692012     0.703717     0.656780     0.703699
max       3.109005     3.928516     3.207888     3.247271

In [151]:
col = data[2]

In [152]:
col[col.abs() > 3]

56     3.207888
220   -3.532851
438   -3.058889
704   -3.584241
Name: 2, dtype: float64

In [153]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
56   1.686803 -0.417320  3.207888 -0.767808
65  -3.400652 -2.142929 -0.751568 -0.536276
167  0.564280 -3.132459 -0.034910  1.417207
213 -0.074303  3.283929  0.499965  0.219861
220  2.017054  2.147426 -3.532851  0.689299
417  0.317045 -0.714410  0.950510  3.247271
438  0.088857  0.258603 -3.058889  1.135056
689 -0.810341  3.839606  0.295804  0.630315
704 -0.578942  0.680580 -3.584241 -1.770755
904 -0.799234  3.928516  0.345881  0.389758
956  3.109005 -0.700978 -0.483759 -0.451954

In [154]:
data[data.abs() > 3] = np.sign(data) * 3

In [155]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.005054     0.027194    -0.005221     0.041106
std       1.003608     1.001640     1.007964     0.973234
min      -3.000000    -3.000000    -3.000000    -2.716920
25%      -0.697211    -0.666513    -0.700967    -0.618165
50%      -0.006616     0.008676    -0.009014     0.011095
75%       0.692012     0.703717     0.656780     0.703699
max       3.000000     3.000000     3.000000     3.000000

In [156]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1 -1.0 -1.0 -1.0 -1.0
2  1.0  1.0  1.0  1.0
3  1.0  1.0 -1.0  1.0
4 -1.0  1.0  1.0 -1.0

In [157]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))

In [158]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [159]:
sampler = np.random.permutation(5)

In [160]:
sampler

array([4, 3, 2, 1, 0], dtype=int32)

In [161]:
df.take(sampler)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6

In [162]:
df.iloc[sampler]

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6

In [163]:
column_sampler = np.random.permutation(7)

In [164]:
column_sampler

array([4, 0, 5, 3, 1, 6, 2], dtype=int32)

In [165]:
df.take(column_sampler, axis="columns")

    4   0   5   3   1   6   2
0   4   0   5   3   1   6   2
1  11   7  12  10   8  13   9
2  18  14  19  17  15  20  16
3  25  21  26  24  22  27  23
4  32  28  33  31  29  34  30

In [166]:
df.sample(n=3)

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13

In [167]:
choices = pd.Series([5, 7, -1, 6, 4])

In [168]:
choices.sample(n=10, replace=True)

3    6
1    7
3    6
3    6
2   -1
2   -1
3    6
4    4
3    6
1    7
dtype: int64